# Определяет интерфейс для создания объекта, но оставляет подклассам
# решение о том, какой класс инстанциировать. Фабричный метод 
# позволяет классу делегировать создание подклассов. Используется, когда:
# - классу заранее неизвестно, объекты каких подклассов ему нужно создавать.
# - класс спроектирован так, чтобы объекты, которые он создаёт,
# специфицировались подклассами.
# - класс делегирует свои обязанности одному из нескольких 
# вспомогательных подклассов, и планируется локализовать знание о том,
# какой класс принимает эти обязанности на себя.

